# PANDAS LIBRARY IN PYTHON

In [1]:
#PANDAS
#OPEN SOURCE,EXPLORING DATA USEFUL

In [ ]:
#dataframe,dataseries 
#data frame is a combination of columns and rows when you load data using pandas then it will be converted into dataframe

In [54]:
#first import the required libraries generally you need to import
#both pandas and numpy at once 
import pandas as pd
import numpy as np

In [3]:
#dataframe
#syntax of data frame 
#df=pd.DataFrame(data.index,columns,dtype)

In [6]:
df=pd.DataFrame(np.arange(0,20).reshape(5,4),index=['Row1','Row2','Row3','Row4','Row5'],columns=['column1','column2','column3','column4'])

In [7]:
df.head()

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [9]:
#you can convert the data sell into excel sheet also 
df.to_csv('Test1.csv')

In [10]:
#now if you go the jupyter home page you will find the excel file

In [11]:
#accessing the elements 
#1. .loc 2. .iloc
df.loc['Row1']

column1    0
column2    1
column3    2
column4    3
Name: Row1, dtype: int32

In [12]:
type(df.loc['Row1'])

pandas.core.series.Series

In [14]:
#series can be any one row or one column

In [15]:
df.iloc[:,:]

      column1  column2  column3  column4
Row1        0        1        2        3
Row2        4        5        6        7
Row3        8        9       10       11
Row4       12       13       14       15
Row5       16       17       18       19

In [21]:
#take the elements form the column2
df.iloc[0:2,1:3]

      column2  column3
Row1        1        2
Row2        5        6

In [18]:
#note:in R indexing starts from 1 but in python indexing starts from 0

In [20]:
type(df.iloc[0:2,1:3])

pandas.core.frame.DataFrame

In [22]:
#CHECKING THE NULL CONDITION
df.isnull().sum()

column1    0
column2    0
column3    0
column4    0
dtype: int64

In [24]:
df['column1'].value_counts()

12    1
4     1
16    1
8     1
0     1
Name: column1, dtype: int64

In [25]:
df['column1'].unique()

array([ 0,  4,  8, 12, 16])

In [26]:
#part2 secodnvideo
#reading data sets

In [ ]:
#csv means comma seperated file #delimite
#basic syntax isgiven below 
df=pd.read_csv('write file name here')

In [ ]:
df.head()#prints the head of the dataset

In [ ]:
df.info()#gives the information about the dataframe

In [ ]:
df.describe()#provides more values of data than head
#when you use describe categorical features will be skipped 
#because you cannot find mean for categorical variables

In [31]:
#csv files will have all the attributes seprerated by comma 
#here comma is called delimiter

In [ ]:
#if the data in the csv files is not seperated by comma and for example 
#if you seperate with ; then the following code should be typed 
# test_df=pd.read_csv('test1.csv',sep=';')
#test_df.head()
#output will aslo include the data seperated  by comma

In [ ]:
#inbuiltfunctions 
#getting the unique category counts 
df['X0'].value_counts()
#gives you count of all the unique categories present

In [ ]:
#selectiveprinting
df[df['y']>100]
#prints all values where value of y is greater than 100

In [33]:
#more  about csv 
from io import StringIO,BytesIO

In [34]:
#creating data inform of csv with commas
data= ('col1,col2,col3\n'
      'x,y,1\n'
      'a,b,2\n'
      'c,d,3')

In [35]:
type(data)
#checkingthedatatype of the data

str

In [36]:
#nowusing the readcsv we will try otread
pd.read_csv(StringIO(data))

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [37]:
#yougotadataframe
#thereadcsv file convertedthe comma seperated files into dataframe

In [40]:
#readingfromspecificcolumns
df=pd.read_csv(StringIO(data),usecols=['col1','col3'])

In [42]:
df

  col1  col3
0    x     1
1    a     2
2    c     3

In [44]:
#converting back to csv file 
df.to_csv('Test.csv')

In [45]:
#now you can go to home page and check for the text.csv file and 
#and you wil have the data thatyou have wirtten before int the form of a file

In [46]:
print(data)

col1,col2,col3
x,y,1
a,b,2
c,d,3

In [50]:
#when you want to give customdatatype
df=pd.read_csv(StringIO(data),dtype=object)
#now all the columns will be objects

In [51]:
df

  col1 col2 col3
0    x    y    1
1    a    b    2
2    c    d    3

In [53]:
#accesingcolumns
df['col1']

0    x
1    a
2    c
Name: col1, dtype: object

In [ ]:
#eachcolumnyoucanspecify as differentdatype
df=pd.read_csv(StringIO(data),dtype={'col1':int,'col3':float,'col2':'Int64'})

In [57]:
df

  col1 col2  col3
0    x    y     1
1    a    b     2
2    c    d     3

In [62]:
type(df['col1'][1])

str

In [66]:
#checkthedatatypes
df.dtypes

col1    object
col2    object
col3     int64
dtype: object

In [69]:
#ifyouwantotmakeacolumnas index
pd.read_csv(StringIO(data),index_col=0)
#here we are making the  first column as index

     col2  col3
col1
x       y     1
a       b     2
c       d     3

In [70]:
#quoting and Escape characters very useful in NLP
data='a,b\n"hello,\\Bob\\",nice to see you",5'
#this data has lot of escape character let us see now how can we convert this into 
#daatframe

In [73]:
pd.read_csv(StringIO(data),escapechar='\\')
#here we have use dthe inbuilt parameter the escape character

                            a  b
0  hello,Bob",nice to see you  5

In [ ]:
#URL TO CSV
df=pd.read_csv('link',sep='\t')
#when you type df.head() you will get the dataframe

In [74]:
#converting other formats into csv 
#third video of pandas

In [77]:
#read json to csv
#creating a json 
Data='{"employee_name":"James","email":"james@gmail.com","job_profile":[{"title1":"Team Lead","title2":"Sr.Developer"}]}'
pd.read_json(Data)
#check the parameters that can be given in the above argument

,employee_name,email,job_profile
0,James,james@gmail.com,"{'title1': 'Team Lead', 'title2': 'Sr.Developer'}"

In [78]:
#hereyouhaveanother nested json data in job profile 
#if you want to display that also then you have to read the data using the function

In [ ]:
#suppose in any weblink the data is in json format do as follows 
=Nonedf=pd.read_csv('link form where you have the dataset in form of json',header=None)
df.head()
#conveerting this data into csv file 
df>to_csv('wine.csv')
#now if you go to homepage you will find the csv format of the data

In [ ]:
#converting to json and different json formats
df.to_json(orient="")

In [79]:
#reading HTML  content

In [81]:
url='https://www.fdic.gov/bank/individual/failed/banklist.html'
dfs=pd.read_html(url)
#if your link doesnt have any tables then it wont read any thing 
#i firstvgave some other link which donot have tables

In [82]:
dfs[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [83]:
type(dfs)

list

In [84]:
#irrespective as trhe pages in the url this takes all the data from the link no matter what

In [85]:
url_mcc='https://en.wikipedia.org/wiki/Mobile_country_code'
dfs=pd.read_html(url_mcc,match='country',header=0)
#match  parameter significance given below

In [86]:
dfs[0]

,Mobile country code,Country,ISO 3166,Mobile network codes,National MNC authority,Remarks
0,289,A Abkhazia,GE-AB,List of mobile network codes in Abkhazia,NaN,MCC is not listed by ITU
1,412,Afghanistan,AF,List of mobile network codes in Afghanistan,NaN,NaN
2,276,Albania,AL,List of mobile network codes in Albania,NaN,NaN
3,603,Algeria,DZ,List of mobile network codes in Algeria,NaN,NaN
4,544,American Samoa (United States of America),AS,List of mobile network codes in American Samoa,NaN,NaN
...,...,...,...,...,...,...
247,452,Vietnam,VN,List of mobile network codes in the Vietnam,NaN,NaN
248,543,W Wallis and Futuna,WF,List of mobile network codes in Wallis and Futuna,NaN,NaN
249,421,Y Yemen,YE,List of mobile network codes in the Yemen,NaN,NaN
250,645,Z Zambia,ZM,List of mobile network codes in Zambia,NaN,NaN
251,648,Zimbabwe,ZW,List of mobile network codes in Zimbabwe,NaN,NaN

In [ ]:
#here we used the match parameter
#this helps us to selectivel take the required data instead of taking all the data 
#as in the previous problem

In [ ]:
#READING EXCEL FILES 
df_excel=pd.read_excel('name.xlsx')
df_excel.head()
#in the bracket you have to give the excel file

In [87]:
#pickling concept 
#all pandas objects are equipped with to_pickle methods which use python cpickle module to
#save datastrctures to disk using pickle format

In [ ]:
df_exce;l.to_picle('df_excel')
df=pd.read_pickle('df_excel') #you can read the pickle files also
df.head()
#these are examples
#now if you go to home page you will find the dataset
#main use of pickle is you need not restart the code when you open the kernel

In [88]:
#for futher reference 
#go to pandas documentation 
#and press shift(dodnot know the function command properly) 
#when you start function to know parameters